programming/2.org
#+TITLE: programming-languages学习笔记--第2部分
#+DESCRIPTION: 测试通过Org-mode提交到cnblogs,本节学习创建自己的类型:定义新类型，构造新类型的值及使用这些值。 思考"复合类型(compound types)"。 使用模式匹配访问复合类型的值。 最后还有尾递归。
#+KEYWORDS: programming, sml
#+CATEGORIES: 编程
#+LANGUAGE: zh-CN


* 自定义类型
  - 基本类型 (int bool unit char)
  - 复合类型 (tuples, lists, options)

  构造复合类型:
  - each of: 组合所有 例如:tuples, (int * bool) 包含一个int和一个bool, 与java中带的字段类相似
  - one of: 选择一个 例如:option, int option可以包含一个int或者空，java中可以通过子类化实现。
  - self reference: 自引用类型，用于构造递归数据类型，例如列表和树

  list使用了全部3种构造


* Records
  属于"each-of"类型：
  - record的值用字段来保存
  - record的类型也用字段保存
  - 字段的顺序无关紧要

  与tuple相比更容易记忆(有字段名)，

  注意代码中-开始的行是repl的输入，下面是输出。
#+begin_src sml
  - val x = {bar = (1+2, true andalso true), foo = 3+4, baz = (false,9)};
  val x = {bar=(3,true),baz=(false,9),foo=7}
          : {bar:int * bool, baz:bool * int, foo:int}
  - #bar x;
  val it = (3,true) : int * bool
  - #foo x;
  val it = 7 : int
#+end_src
   ML中不需要定义record类型，直接写record表达式，类型检查器会给出正确的类型。


* tuples as syntactic sugar
  records和tuples很相似。都是"each-of"构造。唯一的不同是records通过名称访问，tuples通过位置访问。
  java的方法调用组合了这两种方式:方法内使用变量名访问不同的参数，但调用者通过位置传递参数。

  可以通过构造records来定义tuples:
#+begin_src sml
  - - val a_pair = (3+1, 4+2);
  val a_pair = (4,6) : int * int

  - - val a_record = {second=4+2, first=3+1};
  val a_record = {first=4,second=6} : {first:int, second:int}

  - - val another_pair = {2=5, 1=6};
  val another_pair = (6,5) : int * int

  - - #1 a_pair + #2 another_pair;
  val it = 9 : int

  - - val x = {3="hi", 1=true};
  val x = {1=true,3="hi"} : {1:bool, 3:string}

  - - val y = {3="hi", 1=true, 2=3+2};
  val y = (true,5,"hi") : bool * int * string
#+end_src
  实际上，tuple就是record, tuple是record的语法糖

  方便设计实现(语言核心足够简单)，方便理解

* datatype bindings
#+begin_src sml
  datatypee mytype = TwoInts of int * int
                   | Str of string
                   | Pizza
#+end_src
  每个mytype的值都从一个构造器产生,
  每个值包括:构造的tag, 对应的数据

  上面的示例创建一个新类型 *mytype* 和3个构造器 *TwoInts*, *Str*, *Pizza*

  构造器两种表示，它可以是创建新类型值的函数(如果有 *of t* )，或者是新类型的值。
  上面的示例中， *TwoInts* 是一个函数，类型为 *int\*int -> mytype*, *Str* 是一个类型为 *string->mytype* 的函数， *Pizza* 是类型为 *mytype* 的值。


  要访问datatype的值，需要:
  1. 检查是哪个构造器构造的
  2. 提取数据

  例如: null 和 isSome检查;
  ht,tl 和 valOf 提取数据

#+begin_src sml
  - - datatype exp = Constant of int
                   | Negate of exp
                   | Add of exp * exp
                   | Multiply of exp * exp ;
  datatype exp
    = Add of exp * exp | Constant of int | Multiply of exp * exp | Negate of exp

  - - val r = Add (Constant (10 + 9), Negate (Constant 4));
  val r = Add (Constant 19,Negate (Constant 4)) : exp

  - - fun eval e =
          case e of
              Constant i     => i
           |  Negate e2      =>  ~ (eval e2)
           |  Add(e1, e2)    => (eval e1) + (eval e2)
           |  Multiply(e1,e2) =>  (eval e1) * (eval e2)
          ;
  = val eval = fn : exp -> int

  - - eval r;
  val it = 15 : int

#+end_src
* case 表达式
  ML使用case表达式和模式匹配访问"one-of"值
#+begin_src sml
  - - datatype mytype = TwoInts of int * int
                      | Str of string
                      | Pizza
                                 ;
  = datatype mytype = Pizza | Str of string | TwoInts of int * int

  - fun f (x : mytype) =
        case x of
            Pizza => 3
         |  Str s  =>  8
         |  TwoInts(i1, i2) => i1 + i2
                                 ;
  = val f = fn : mytype -> int

  - - f Pizza;
  val it = 3 : int

  - - f (TwoInts (7, 9));
  val it = 16 : int
#+end_src

  在某种意义上，case表达式就像一个更强大的if-then-else表达式。它首先求值 *case* 和 *of* 中间的表达式，然后求值第一个匹配的分支的表达式。和条件表达式一样，每个分支表达式必须有相同的类型，作为case表达式的值。

  对于每个分支 *p => e* p是一个模式，e是一个表达式；使用|分割多个分支。模式看起来像表达式，但不要把它们想做表达式。它们用来匹配case的第一个表达式( *case* 后面的部分)的值。这就是为什么case表达式叫做模式匹配。


