programming/2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2018-12-05 Wed 13:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>programming-languages学习笔记&#x2013;第2部分</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ntestoc" />
<meta name="description" content="测试通过Org-mode提交到cnblogs,本节学习创建自己的类型:定义新类型，构造新类型的值及使用这些值。 思考&quot;复合类型(compound types)&quot;。 使用模式匹配访问复合类型的值。 最后还有尾递归。"
 />
<meta name="keywords" content="programming, sml" />
</head>
<body>
<div id="content">
<h1 class="title">programming-languages学习笔记&#x2013;第2部分</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67ea651">1. 自定义类型</a></li>
<li><a href="#orgaf3dd37">2. Records</a></li>
<li><a href="#org01c7244">3. tuples as syntactic sugar</a></li>
<li><a href="#orga02e7db">4. datatype bindings</a></li>
<li><a href="#orgb8cf071">5. case 表达式</a></li>
<li><a href="#orgb216fdd">6. 类型同义词</a></li>
<li><a href="#orgfc7e20b">7. Lists和Options也是datatype</a></li>
<li><a href="#org0f768ea">8. 多态数据类型</a></li>
<li><a href="#org46eda57">9. Each-of类型的模式匹配:val绑定的真相</a></li>
<li><a href="#orgc626028">10. 类型推断,多态类型与相等类型</a></li>
<li><a href="#org3190ed9">11. 嵌套模式</a></li>
<li><a href="#org9c5f5b6">12. 异常</a></li>
<li><a href="#org2839301">13. 尾递归和累加器</a></li>
</ul>
</div>
</div>


<div id="outline-container-org67ea651" class="outline-2">
<h2 id="org67ea651"><span class="section-number-2">1</span> 自定义类型</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>基本类型 (int bool unit char)</li>
<li>复合类型 (tuples, lists, options)</li>
</ul>

<p>
构造复合类型:
</p>
<ul class="org-ul">
<li>each of: 组合所有 例如:tuples, (int * bool) 包含一个int和一个bool, 与java中带的字段类相似</li>
<li>one of: 选择一个 例如:option, int option可以包含一个int或者空，java中可以通过子类化实现。</li>
<li>self reference: 自引用类型，用于构造递归数据类型，例如列表和树</li>
</ul>

<p>
list使用了全部3种构造
</p>
</div>
</div>


<div id="outline-container-orgaf3dd37" class="outline-2">
<h2 id="orgaf3dd37"><span class="section-number-2">2</span> Records</h2>
<div class="outline-text-2" id="text-2">
<p>
属于"each-of"类型：
</p>
<ul class="org-ul">
<li>record的值用字段来保存</li>
<li>record的类型也用字段保存</li>
<li>字段的顺序无关紧要</li>
</ul>

<p>
与tuple相比更容易记忆(有字段名)，
</p>

<p>
注意代码中-开始的行是repl的输入，下面是输出。
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">x</span> = {bar = (1+2, true <span style="color: #c397d8;">andalso</span> true), foo = 3+4, baz = (false,9)};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">x</span> = {bar=(3,true),baz=(false,9),foo=7}
        : {bar:int * bool, baz:bool * int, foo:int}
- #bar x;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = (3,true) : int * bool
- #foo x;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = 7 : int
</pre>
</div>
<p>
ML中不需要定义record类型，直接写record表达式，类型检查器会给出正确的类型。
</p>
</div>
</div>


<div id="outline-container-org01c7244" class="outline-2">
<h2 id="org01c7244"><span class="section-number-2">3</span> tuples as syntactic sugar</h2>
<div class="outline-text-2" id="text-3">
<p>
records和tuples很相似。都是"each-of"构造。唯一的不同是records通过名称访问，tuples通过位置访问。
java的方法调用组合了这两种方式:方法内使用变量名访问不同的参数，但调用者通过位置传递参数。
</p>

<p>
可以通过构造records来定义tuples:
</p>
<div class="org-src-container">
<pre class="src src-sml">- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">a_pair</span> = (3+1, 4+2);
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">a_pair</span> = (4,6) : int * int

- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">a_record</span> = {second=4+2, first=3+1};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">a_record</span> = {first=4,second=6} : {first:int, second:int}

- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">another_pair</span> = {2=5, 1=6};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">another_pair</span> = (6,5) : int * int

- - #1 a_pair + #2 another_pair;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = 9 : int

- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">x</span> = {3=<span style="color: #b9ca4a;">"hi"</span>, 1=true};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">x</span> = {1=true,3=<span style="color: #b9ca4a;">"hi"</span>} : {1:bool, 3:string}

- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">y</span> = {3=<span style="color: #b9ca4a;">"hi"</span>, 1=true, 2=3+2};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">y</span> = (true,5,<span style="color: #b9ca4a;">"hi"</span>) : bool * int * string
</pre>
</div>
<p>
实际上，tuple就是record, tuple是record的语法糖
</p>

<p>
方便设计实现(语言核心足够简单)，方便理解
</p>
</div>
</div>

<div id="outline-container-orga02e7db" class="outline-2">
<h2 id="orga02e7db"><span class="section-number-2">4</span> datatype bindings</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-sml">datatypee mytype = TwoInts <span style="color: #c397d8;">of</span> int * int
                 | Str <span style="color: #c397d8;">of</span> string
                 | Pizza
</pre>
</div>
<p>
每个mytype的值都从一个构造器产生,
每个值包括:构造的tag, 对应的数据
</p>

<p>
上面的示例创建一个新类型 <b>mytype</b> 和3个构造器 <b>TwoInts</b>, <b>Str</b>, <b>Pizza</b>
</p>

<p>
构造器两种表示，它可以是创建新类型值的函数(如果有 <b>of t</b> )，或者是新类型的值。
上面的示例中， <b>TwoInts</b> 是一个函数，类型为 <b>int\*int -&gt; mytype</b>, <b>Str</b> 是一个类型为 <b>string-&gt;mytype</b> 的函数， <b>Pizza</b> 是类型为 <b>mytype</b> 的值。
</p>


<p>
要访问datatype的值，需要:
</p>
<ol class="org-ol">
<li>检查是哪个构造器构造的</li>
<li>提取数据</li>
</ol>

<p>
例如: null 和 isSome检查;
ht,tl 和 valOf 提取数据
</p>

<div class="org-src-container">
<pre class="src src-sml">- - <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">exp</span> = Constant <span style="color: #c397d8;">of</span> int
                 | Negate <span style="color: #c397d8;">of</span> exp
                 | Add <span style="color: #c397d8;">of</span> exp * exp
                 | Multiply <span style="color: #c397d8;">of</span> exp * exp ;
<span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">exp</span>
  = Add <span style="color: #c397d8;">of</span> exp * exp | Constant <span style="color: #c397d8;">of</span> int | Multiply <span style="color: #c397d8;">of</span> exp * exp | Negate <span style="color: #c397d8;">of</span> exp

- - <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">r</span> = Add (Constant (10 + 9), Negate (Constant 4));
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">r</span> = Add (Constant 19,Negate (Constant 4)) : exp

- - <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">eval</span> e =
        <span style="color: #c397d8;">case</span> e <span style="color: #c397d8;">of</span>
            Constant i     =&gt; i
         |  Negate e2      =&gt;  ~ (eval e2)
         |  Add(e1, e2)    =&gt; (eval e1) + (eval e2)
         |  Multiply(e1,e2) =&gt;  (eval e1) * (eval e2)
        ;
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">eval</span> = <span style="color: #c397d8;">fn</span> : exp -&gt; int

- - eval r;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = 15 : int

</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8cf071" class="outline-2">
<h2 id="orgb8cf071"><span class="section-number-2">5</span> case 表达式</h2>
<div class="outline-text-2" id="text-5">
<p>
ML使用case表达式和模式匹配访问"one-of"值
</p>
<div class="org-src-container">
<pre class="src src-sml">- - <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">mytype</span> = TwoInts <span style="color: #c397d8;">of</span> int * int
                    | Str <span style="color: #c397d8;">of</span> string
                    | Pizza
                               ;
= <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">mytype</span> = Pizza | Str <span style="color: #c397d8;">of</span> string | TwoInts <span style="color: #c397d8;">of</span> int * int

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">f</span> (x : mytype) =
      <span style="color: #c397d8;">case</span> x <span style="color: #c397d8;">of</span>
          Pizza =&gt; 3
       |  Str s  =&gt;  8
       |  TwoInts(i1, i2) =&gt; i1 + i2
                               ;
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">f</span> = <span style="color: #c397d8;">fn</span> : mytype -&gt; int

- - f Pizza;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = 3 : int

- - f (TwoInts (7, 9));
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = 16 : int
</pre>
</div>

<p>
在某种意义上，case表达式就像一个更强大的if-then-else表达式。它首先求值 <b>case</b> 和 <b>of</b> 中间的表达式，然后求值第一个匹配的分支的表达式。和条件表达式一样，每个分支表达式必须有相同的类型，作为case表达式的值。
</p>

<p>
对于每个分支 <b>p =&gt; e</b> p是一个模式，e是一个表达式；使用|分割多个分支。模式看起来像表达式，但不要把它们想做表达式。它们用来匹配case的第一个表达式( <b>case</b> 后面的部分)的值。这就是为什么case表达式叫做模式匹配。
</p>
</div>
</div>
