programming/2.org
* 类型同义词
  type aname = t

  两个名字可以互换使用

#+begin_src sml
  - datatype suit = Club | Diamond | Heart | Spade ;
  datatype suit = Club | Diamond | Heart | Spade

  - datatype rank = Jack | Queen | King | Ace | Num of int;
  datatype rank = Ace | Jack | King | Num of int | Queen

  - type card = suit * rank;
  type card = suit * rank

  - type name_record = { student_num : int option,
                         first : string,
                         middle : string option,
                         last : string };
  type name_record =
       {first:string, last:string, middle:string option, student_num:int option}

  - fun is_Queen_of_Spades (c : card) =
       #1 c = Spade andalso #2 c = Queen;
  val is_Queen_of_Spades = fn : card -> bool

  - val c1 : card = (Diamond, Ace);
  val c1 = (Diamond,Ace) : card

  - val c2 : suit * rank = (Heart, Ace);
  val c2 = (Heart,Ace) : suit * rank

  - val c3 = (Spade, Ace);
  val c3 = (Spade,Ace) : suit * rank

  - is_Queen_of_Spades c1;
  val it = false : bool

  - is_Queen_of_Spades c2;
  val it = false : bool

  - is_Queen_of_Spades c3;
  val it = false : bool

#+end_src

* Lists和Options也是datatype
  因为datatype可以递归定义，我们可以用来定义自己的lists类型:
#+begin_src sml
  - datatype my_int_list = Empty
                         | Cons of int * my_int_list ;
  = datatype my_int_list = Cons of int * my_int_list | Empty

  - val one_two_three = Cons(1, Cons(2, Cons(3, Empty)));
  val one_two_three = Cons (1,Cons (2,Cons #)) : my_int_list

  - fun append_mylist (xs, ys) =
      case xs of
          Empty        => ys
        | Cons(x, xs') =>  Cons(x, append_mylist(xs', ys));
  = val append_mylist = fn : my_int_list * my_int_list -> my_int_list

#+end_src

  对于options, *SOME* 和 *NONE* 是构造器。
  对于lists来说 *[]* 和 *::* 都是构造器。::有点特殊，因为它是中缀操作符(在两个操作数中间)。
#+begin_src sml
  - fun inc_or_zero intoption =
      case intoption of
          NONE => 0
       |  SOME i => i + 1 ;
  = val inc_or_zero = fn : int option -> int

  - fun append(xs, ys) =
      case xs of
          [] => ys
       |  x::xs' => x :: append(xs', ys) ;
  = val append = fn : 'a list * 'a list -> 'a list
#+end_src

  模式匹配的优点: 不会有例外情况。不能应用错误的函数。

* 多态数据类型
  好的语言设计：定义自己的多态类型
#+begin_src sml
  datatype 'a option = NONE | SOME of 'a

  datatype 'a mylist = Empty | Cons of 'a * 'a mylist

  datatype ('a, 'b) tree =
           Node of 'a * ('a, 'b) tree * ('a, 'b) tree
           | Leaf of 'b
#+end_src

* Each-of类型的模式匹配:val绑定的真相
  val绑定模式，val绑定可以使用模式， val p = e, 例如:
#+begin_src sml
  - val (x,y) = (1,2);
  val x = 1 : int
  val y = 2 : int

  - val {f1=a, f2=b} = {f2 =5, f1=3};
  val a = 3 : int
  val b = 5 : int
#+end_src

  当知道一个模式肯定会被匹配时，使用模式匹配就是为了提取值。
#+begin_src sml
  - fun full_name (r : {first:string, middle:string, last:string}) =
      let val {first=x, middle=y, last=z} = r
      in
          x ^ " " ^ y ^ " " ^ z
      end
  val full_name = fn : {first:string, last:string, middle:string} -> string

  - fun sum_triple (triple : int*int*int) =
      let val (x,y,z) = triple
      in
          x + y + z
      end
  val sum_triple = fn : int * int * int -> int

  (* 在定义函数绑定中使用模式 *)
  - fun full_name {first=x, middle=y, last=z} = x ^ " " ^ y ^ " " ^ z
  = val full_name = fn : {first:string, last:string, middle:string} -> string

  - full_name {first="a", middle="b", last="c"};
  val it = "a b c" : string

  - fun sum_triple (x,y,z) = x + y + z
  = val sum_triple = fn : int * int * int -> int
#+end_src

  ML中的所有函数都是一个参数，按照模式匹配展开，可以是tuple:(a,b,c);也可以是record:{a,b,c}或者其它。
  这种灵活性很有用，可以把函数的返回值直接传递给其它有多个参数的函数。没有无参数的函数，hello()也是一个参数(空的tuple， *unit* 类型)。因为存在预定义的类型 , *datatype unit = ()*

* 类型推断,多态类型与相等类型
  在ML中，所有的变量和函数都有一个类型，类型推断只是表示不需要把类型写下来。

  类型推断有时会让你的函数更通用。

  多态表示更通用的类型，例如append的类型 *'a list * 'a list -> 'a list* ,可以统一地把'a替换为 *string*,就像append具有 *string list * string list -> string list* 类型一样使用。可以用任何类型替换'a。

  *''a* 表示相等类型：
#+begin_src sml
  - fun same_thing(x,y) = if x=y then "yes" else "no";
  stdIn:1.28 Warning: calling polyEqual
  val same_thing = fn : ''a * ''a -> string
#+end_src

