programming/2.html


<div id="outline-container-orgb216fdd" class="outline-2">
<h2 id="orgb216fdd"><span class="section-number-2">6</span> 类型同义词</h2>
<div class="outline-text-2" id="text-6">
<p>
type aname = t
</p>

<p>
两个名字可以互换使用
</p>

<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">suit</span> = Club | Diamond | Heart | Spade ;
<span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">suit</span> = Club | Diamond | Heart | Spade

- <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">rank</span> = Jack | Queen | King | Ace | Num <span style="color: #c397d8;">of</span> int;
<span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">rank</span> = Ace | Jack | King | Num <span style="color: #c397d8;">of</span> int | Queen

- <span style="color: #c397d8;">type</span> <span style="font-weight: bold;">card</span> = suit * rank;
<span style="color: #c397d8;">type</span> <span style="font-weight: bold;">card</span> = suit * rank

- <span style="color: #c397d8;">type</span> <span style="font-weight: bold;">name_record</span> = { student_num : int option,
                       first : string,
                       middle : string option,
                       last : string };
<span style="color: #c397d8;">type</span> <span style="font-weight: bold;">name_record</span> =
     {first:string, last:string, middle:string option, student_num:int option}

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">is_Queen_of_Spades</span> (c : card) =
     #1 c = Spade <span style="color: #c397d8;">andalso</span> #2 c = Queen;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">is_Queen_of_Spades</span> = <span style="color: #c397d8;">fn</span> : card -&gt; bool

- <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c1</span> : card = (Diamond, Ace);
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c1</span> = (Diamond,Ace) : card

- <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c2</span> : suit * rank = (Heart, Ace);
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c2</span> = (Heart,Ace) : suit * rank

- <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c3</span> = (Spade, Ace);
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">c3</span> = (Spade,Ace) : suit * rank

- is_Queen_of_Spades c1;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = false : bool

- is_Queen_of_Spades c2;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = false : bool

- is_Queen_of_Spades c3;
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = false : bool

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc7e20b" class="outline-2">
<h2 id="orgfc7e20b"><span class="section-number-2">7</span> Lists和Options也是datatype</h2>
<div class="outline-text-2" id="text-7">
<p>
因为datatype可以递归定义，我们可以用来定义自己的lists类型:
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">my_int_list</span> = Empty
                       | Cons <span style="color: #c397d8;">of</span> int * my_int_list ;
= <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">my_int_list</span> = Cons <span style="color: #c397d8;">of</span> int * my_int_list | Empty

- <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">one_two_three</span> = Cons(1, Cons(2, Cons(3, Empty)));
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">one_two_three</span> = Cons (1,Cons (2,Cons #)) : my_int_list

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">append_mylist</span> (xs, ys) =
    <span style="color: #c397d8;">case</span> xs <span style="color: #c397d8;">of</span>
        Empty        =&gt; ys
      | Cons(x, xs') =&gt;  Cons(x, append_mylist(xs', ys));
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">append_mylist</span> = <span style="color: #c397d8;">fn</span> : my_int_list * my_int_list -&gt; my_int_list

</pre>
</div>

<p>
对于options, <b>SOME</b> 和 <b>NONE</b> 是构造器。
对于lists来说 <b>[]</b> 和 <b>::</b> 都是构造器。::有点特殊，因为它是中缀操作符(在两个操作数中间)。
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">inc_or_zero</span> intoption =
    <span style="color: #c397d8;">case</span> intoption <span style="color: #c397d8;">of</span>
        NONE =&gt; 0
     |  SOME i =&gt; i + 1 ;
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">inc_or_zero</span> = <span style="color: #c397d8;">fn</span> : int option -&gt; int

- <span style="color: #c397d8;">fun</span> append(xs, ys) =
    <span style="color: #c397d8;">case</span> xs <span style="color: #c397d8;">of</span>
        [] =&gt; ys
     |  x::xs' =&gt; x :: append(xs', ys) ;
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">append</span> = <span style="color: #c397d8;">fn</span> : 'a list * 'a list -&gt; 'a list
</pre>
</div>

<p>
模式匹配的优点: 不会有例外情况。不能应用错误的函数。
</p>
</div>
</div>

<div id="outline-container-org0f768ea" class="outline-2">
<h2 id="org0f768ea"><span class="section-number-2">8</span> 多态数据类型</h2>
<div class="outline-text-2" id="text-8">
<p>
好的语言设计：定义自己的多态类型
</p>
<div class="org-src-container">
<pre class="src src-sml"><span style="color: #c397d8;">datatype</span> 'a <span style="font-weight: bold;">option</span> = NONE | SOME <span style="color: #c397d8;">of</span> 'a

<span style="color: #c397d8;">datatype</span> 'a <span style="font-weight: bold;">mylist</span> = Empty | Cons <span style="color: #c397d8;">of</span> 'a * 'a mylist

<span style="color: #c397d8;">datatype</span> ('a, 'b) <span style="font-weight: bold;">tree</span> =
         Node <span style="color: #c397d8;">of</span> 'a * ('a, 'b) tree * ('a, 'b) tree
         | Leaf <span style="color: #c397d8;">of</span> 'b
</pre>
</div>
</div>
</div>

<div id="outline-container-org46eda57" class="outline-2">
<h2 id="org46eda57"><span class="section-number-2">9</span> Each-of类型的模式匹配:val绑定的真相</h2>
<div class="outline-text-2" id="text-9">
<p>
val绑定模式，val绑定可以使用模式， val p = e, 例如:
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">val</span> (x,y) = (1,2);
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">x</span> = 1 : int
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">y</span> = 2 : int

- <span style="color: #c397d8;">val</span> {f1=a, f2=b} = {f2 =5, f1=3};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">a</span> = 3 : int
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">b</span> = 5 : int
</pre>
</div>

<p>
当知道一个模式肯定会被匹配时，使用模式匹配就是为了提取值。
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">full_name</span> (r : {first:string, middle:string, last:string}) =
    <span style="color: #c397d8;">let</span> <span style="color: #c397d8;">val</span> {first=x, middle=y, last=z} = r
    <span style="color: #c397d8;">in</span>
        x ^ <span style="color: #b9ca4a;">" "</span> ^ y ^ <span style="color: #b9ca4a;">" "</span> ^ z
    <span style="color: #c397d8;">end</span>
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">full_name</span> = <span style="color: #c397d8;">fn</span> : {first:string, last:string, middle:string} -&gt; string

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">sum_triple</span> (triple : int*int*int) =
    <span style="color: #c397d8;">let</span> <span style="color: #c397d8;">val</span> (x,y,z) = triple
    <span style="color: #c397d8;">in</span>
        x + y + z
    <span style="color: #c397d8;">end</span>
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">sum_triple</span> = <span style="color: #c397d8;">fn</span> : int * int * int -&gt; int

<span style="color: #969896; font-style: italic;">(* </span><span style="color: #969896; font-style: italic;">&#22312;&#23450;&#20041;&#20989;&#25968;&#32465;&#23450;&#20013;&#20351;&#29992;&#27169;&#24335; </span><span style="color: #969896; font-style: italic;">*)</span>
- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">full_name</span> {first=x, middle=y, last=z} = x ^ <span style="color: #b9ca4a;">" "</span> ^ y ^ <span style="color: #b9ca4a;">" "</span> ^ z
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">full_name</span> = <span style="color: #c397d8;">fn</span> : {first:string, last:string, middle:string} -&gt; string

- full_name {first=<span style="color: #b9ca4a;">"a"</span>, middle=<span style="color: #b9ca4a;">"b"</span>, last=<span style="color: #b9ca4a;">"c"</span>};
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">it</span> = <span style="color: #b9ca4a;">"a b c"</span> : string

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">sum_triple</span> (x,y,z) = x + y + z
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">sum_triple</span> = <span style="color: #c397d8;">fn</span> : int * int * int -&gt; int
</pre>
</div>

<p>
ML中的所有函数都是一个参数，按照模式匹配展开，可以是tuple:(a,b,c);也可以是record:{a,b,c}或者其它。
这种灵活性很有用，可以把函数的返回值直接传递给其它有多个参数的函数。没有无参数的函数，hello()也是一个参数(空的tuple， <b>unit</b> 类型)。因为存在预定义的类型 , <b>datatype unit = ()</b>
</p>
</div>
</div>

<div id="outline-container-orgc626028" class="outline-2">
<h2 id="orgc626028"><span class="section-number-2">10</span> 类型推断,多态类型与相等类型</h2>
<div class="outline-text-2" id="text-10">
<p>
在ML中，所有的变量和函数都有一个类型，类型推断只是表示不需要把类型写下来。
</p>

<p>
类型推断有时会让你的函数更通用。
</p>

<p>
多态表示更通用的类型，例如append的类型 <b>'a list * 'a list -&gt; 'a list</b> ,可以统一地把'a替换为 <b>string</b>,就像append具有 <b>string list * string list -&gt; string list</b> 类型一样使用。可以用任何类型替换'a。
</p>

<p>
<b>''a</b> 表示相等类型：
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">fun</span> same_thing(x,y) = <span style="color: #c397d8;">if</span> x=y <span style="color: #c397d8;">then</span> <span style="color: #b9ca4a;">"yes"</span> <span style="color: #c397d8;">else</span> <span style="color: #b9ca4a;">"no"</span>;
stdIn:1.28 Warning: calling polyEqual
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">same_thing</span> = <span style="color: #c397d8;">fn</span> : ''a * ''a -&gt; string
</pre>
</div>
</div>
</div>
