programming/2.org
* 嵌套模式
  模式是递归的。通常模式匹配就是取一个值和一个模式，然后确定模式是否与值匹配，如果匹配，变量绑定到值的正确部分。模式匹配的递归定义的关键点:
  - 一个变量模式(x)匹配任意值v并引入一个绑定
  - 模式 *C* 匹配值 *C* ，如果 *C* 是一个没有任何数据的构造器
  - 模式 *C p* (构造器 *C* 和 模式 *p* )匹配一个值 *C v* (注意构造器相同),如果 *p* 匹配 *v* (嵌套模式匹配携带的值)。它引入了 *p* 匹配 *v* 的绑定。
  - 模式(p1,p2,...,pn)匹配tuple值(v1,v2,...,vn),如果p1匹配v1,p2匹配v2,...,pn匹配vn.它引入所有递归匹配引入的绑定。
  - record模式与tuple类似 {f1=p1,...,fn=pn}

  模式匹配中使用通配符 *_* 匹配所有值，但不会引入新绑定。

#+begin_src sml
  - exception BadTriple
  exception BadTriple

  - fun zip list_triple =
      case list_triple of
         ([],[],[]) => []
       | (hd1::tl1, hd2::tl2, hd3::tl3) => (hd1,hd2,hd3)::zip(tl1,tl2,tl3)
       | _ => raise BadTriple
  val zip = fn : 'a list * 'b list * 'c list -> ('a * 'b * 'c) list

  - fun unzip3 lst =
      case lst of
          [] => ([],[],[])
       |  (a,b,c)::tl => let val (l1,l2,l3) = unzip3 tl
                         in
                             (a::l1, b::l2, c::l3)
                         end
  val unzip3 = fn : ('a * 'b * 'c) list -> 'a list * 'b list * 'c list

  - fun nondecreasing intlist =
      case intlist of
          [] => true
       |  _::[] => true
       |  head::(neck::rest) => (head <= neck andalso nondecreasing (neck::rest))
  val nondecreasing = fn : int list -> bool

  - datatype sgn = P | N | Z
  = datatype sgn = N | P | Z

  - fun multsign (x1,x2) =
      let fun sign x = if x=0 then Z else if x>0 then P else N
      in
          case (sign x1,sign x2) of
              (Z, _) => Z
           |  (_, Z) => Z
           |  (P, P) => P
           |  (N, N) => N
           |  _      => N
      end
  = val multsign = fn : int * int -> sgn
#+end_src

* 异常
  ML有内置的异常概念。使用 *raise* 抛出一个异常。使用异常绑定创建自己的异常。
  异常构造器可以创建 *exn* 类型的值。
#+begin_src sml
  - exception MyUndesirableCondition
  - exception MyOtherException of int * int

  - fun maxlist (xs, ex) =
      case xs of
          [] => raise ex
       |  x::[]  => x
       |  x::xs' => Int.max(x,maxlist(xs',ex));
  val maxlist = fn : int list * exn -> int
#+end_src

  处理异常使用handle表达式: *e1 handle p => e2* , e1和e2是表达式，p是用来匹配异常的模式。

* 尾递归和累加器
  新的编程模型:尾递归，编写有效率的递归函数。使用累加器把一些函数变为尾递归。
#+begin_src sml
  - fun sum1 xs =
      case xs of
         [] => 0
       | i::xs' => i + sum1 xs'
  val sum1 = fn : int list -> int

  - fun sum2 xs =
      let fun f (xs,acc) =
              case xs of
                  [] => acc
               |  i::xs' => f(xs',i+acc)
      in
          f(xs,0)
      end
  val sum2 = fn : int list -> int
#+end_src
  函数调用的实现依靠调用栈(call stack)，调用栈的内容是每个函数为一个元素，这个函数是已启动但还没有完毕的调用。
  每个元素保存局部变量和函数还未求值的部分。当一个函数体内调用了另一个函数，一个新的元素push到调用栈，当被调用的函数完成后弹出。

  对于 *sum1* ,每个 *sum1* 递归调用都会产生一个调用栈元素，栈会和列表一样大。因为在弹出每个栈帧后，调用者要加 *i* 到每个递归结果并返回。

  对于 *sum2* ,在被调用函数返回后，调用函数不需要做任何事，只需返回被调用函数的结果。这种情况叫做尾递归，函数式语言通常会对这种情况优化:当调用一个尾递归调用，调用者的栈帧在调用之前弹出，被调用者的栈帧替换调用者的。这很简单：调用者只是返回被调用者的结果。因此，调用 *sum2* 只需要1个栈帧。

  使用累加器是把递归函数转换为尾递归函数的常用方法。通常转换一个非尾递归函数到尾递归函数需要满足结合律。

  如果一个调用在尾部位置，它就是尾递归调用。尾部位置定义如下：
  - 在 *fun f(x) = e* 中, *e* 在尾部位置
  - 如果一个表达式不在尾部位置，那么它的子表达式都不在尾部位置
  - 如果 *if e1 then e2 else e3* 在尾部位置，则 *e2* 和 *e3* 在尾部位置( *e1* 不在),case表达式类似。
  - 如果 *let b1 ... bn in e end* 在尾部位置， 则 *e* 在尾部位置(但绑定中的表达式不在)。
  - 函数调用参数不在尾部位置。
