programming/2.html

<div id="outline-container-org3190ed9" class="outline-2">
<h2 id="org3190ed9"><span class="section-number-2">11</span> 嵌套模式</h2>
<div class="outline-text-2" id="text-11">
<p>
模式是递归的。通常模式匹配就是取一个值和一个模式，然后确定模式是否与值匹配，如果匹配，变量绑定到值的正确部分。模式匹配的递归定义的关键点:
</p>
<ul class="org-ul">
<li>一个变量模式(x)匹配任意值v并引入一个绑定</li>
<li>模式 <b>C</b> 匹配值 <b>C</b> ，如果 <b>C</b> 是一个没有任何数据的构造器</li>
<li>模式 <b>C p</b> (构造器 <b>C</b> 和 模式 <b>p</b> )匹配一个值 <b>C v</b> (注意构造器相同),如果 <b>p</b> 匹配 <b>v</b> (嵌套模式匹配携带的值)。它引入了 <b>p</b> 匹配 <b>v</b> 的绑定。</li>
<li>模式(p1,p2,&#x2026;,pn)匹配tuple值(v1,v2,&#x2026;,vn),如果p1匹配v1,p2匹配v2,&#x2026;,pn匹配vn.它引入所有递归匹配引入的绑定。</li>
<li>record模式与tuple类似 {f1=p1,&#x2026;,fn=pn}</li>
</ul>

<p>
模式匹配中使用通配符 <b>_</b> 匹配所有值，但不会引入新绑定。
</p>

<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">exception</span> BadTriple
<span style="color: #c397d8;">exception</span> BadTriple

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">zip</span> list_triple =
    <span style="color: #c397d8;">case</span> list_triple <span style="color: #c397d8;">of</span>
       ([],[],[]) =&gt; []
     | (hd1::tl1, hd2::tl2, hd3::tl3) =&gt; (hd1,hd2,hd3)::zip(tl1,tl2,tl3)
     | _ =&gt; <span style="color: #c397d8;">raise</span> BadTriple
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">zip</span> = <span style="color: #c397d8;">fn</span> : 'a list * 'b list * 'c list -&gt; ('a * 'b * 'c) list

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">unzip3</span> lst =
    <span style="color: #c397d8;">case</span> lst <span style="color: #c397d8;">of</span>
        [] =&gt; ([],[],[])
     |  (a,b,c)::tl =&gt; <span style="color: #c397d8;">let</span> <span style="color: #c397d8;">val</span> (l1,l2,l3) = unzip3 tl
                       <span style="color: #c397d8;">in</span>
                           (a::l1, b::l2, c::l3)
                       <span style="color: #c397d8;">end</span>
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">unzip3</span> = <span style="color: #c397d8;">fn</span> : ('a * 'b * 'c) list -&gt; 'a list * 'b list * 'c list

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">nondecreasing</span> intlist =
    <span style="color: #c397d8;">case</span> intlist <span style="color: #c397d8;">of</span>
        [] =&gt; true
     |  _::[] =&gt; true
     |  head::(neck::rest) =&gt; (head &lt;= neck <span style="color: #c397d8;">andalso</span> nondecreasing (neck::rest))
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">nondecreasing</span> = <span style="color: #c397d8;">fn</span> : int list -&gt; bool

- <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">sgn</span> = P | N | Z
= <span style="color: #c397d8;">datatype</span> <span style="font-weight: bold;">sgn</span> = N | P | Z

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">multsign</span> (x1,x2) =
    <span style="color: #c397d8;">let</span> <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">sign</span> x = <span style="color: #c397d8;">if</span> x=0 <span style="color: #c397d8;">then</span> Z <span style="color: #c397d8;">else</span> <span style="color: #c397d8;">if</span> x&gt;0 <span style="color: #c397d8;">then</span> P <span style="color: #c397d8;">else</span> N
    <span style="color: #c397d8;">in</span>
        <span style="color: #c397d8;">case</span> (sign x1,sign x2) <span style="color: #c397d8;">of</span>
            (Z, _) =&gt; Z
         |  (_, Z) =&gt; Z
         |  (P, P) =&gt; P
         |  (N, N) =&gt; N
         |  _      =&gt; N
    <span style="color: #c397d8;">end</span>
= <span style="color: #c397d8;">val</span> <span style="color: #e78c45;">multsign</span> = <span style="color: #c397d8;">fn</span> : int * int -&gt; sgn
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c5f5b6" class="outline-2">
<h2 id="org9c5f5b6"><span class="section-number-2">12</span> 异常</h2>
<div class="outline-text-2" id="text-12">
<p>
ML有内置的异常概念。使用 <b>raise</b> 抛出一个异常。使用异常绑定创建自己的异常。
异常构造器可以创建 <b>exn</b> 类型的值。
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">exception</span> MyUndesirableCondition
- <span style="color: #c397d8;">exception</span> MyOtherException <span style="color: #c397d8;">of</span> int * int

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">maxlist</span> (xs, ex) =
    <span style="color: #c397d8;">case</span> xs <span style="color: #c397d8;">of</span>
        [] =&gt; <span style="color: #c397d8;">raise</span> ex
     |  x::[]  =&gt; x
     |  x::xs' =&gt; Int.max(x,maxlist(xs',ex));
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">maxlist</span> = <span style="color: #c397d8;">fn</span> : int list * exn -&gt; int
</pre>
</div>

<p>
处理异常使用handle表达式: <b>e1 handle p =&gt; e2</b> , e1和e2是表达式，p是用来匹配异常的模式。
</p>
</div>
</div>

<div id="outline-container-org2839301" class="outline-2">
<h2 id="org2839301"><span class="section-number-2">13</span> 尾递归和累加器</h2>
<div class="outline-text-2" id="text-13">
<p>
新的编程模型:尾递归，编写有效率的递归函数。使用累加器把一些函数变为尾递归。
</p>
<div class="org-src-container">
<pre class="src src-sml">- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">sum1</span> xs =
    <span style="color: #c397d8;">case</span> xs <span style="color: #c397d8;">of</span>
       [] =&gt; 0
     | i::xs' =&gt; i + sum1 xs'
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">sum1</span> = <span style="color: #c397d8;">fn</span> : int list -&gt; int

- <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">sum2</span> xs =
    <span style="color: #c397d8;">let</span> <span style="color: #c397d8;">fun</span> <span style="color: #7aa6da;">f</span> (xs,acc) =
            <span style="color: #c397d8;">case</span> xs <span style="color: #c397d8;">of</span>
                [] =&gt; acc
             |  i::xs' =&gt; f(xs',i+acc)
    <span style="color: #c397d8;">in</span>
        f(xs,0)
    <span style="color: #c397d8;">end</span>
<span style="color: #c397d8;">val</span> <span style="color: #e78c45;">sum2</span> = <span style="color: #c397d8;">fn</span> : int list -&gt; int
</pre>
</div>
<p>
函数调用的实现依靠调用栈(call stack)，调用栈的内容是每个函数为一个元素，这个函数是已启动但还没有完毕的调用。
每个元素保存局部变量和函数还未求值的部分。当一个函数体内调用了另一个函数，一个新的元素push到调用栈，当被调用的函数完成后弹出。
</p>

<p>
对于 <b>sum1</b> ,每个 <b>sum1</b> 递归调用都会产生一个调用栈元素，栈会和列表一样大。因为在弹出每个栈帧后，调用者要加 <b>i</b> 到每个递归结果并返回。
</p>

<p>
对于 <b>sum2</b> ,在被调用函数返回后，调用函数不需要做任何事，只需返回被调用函数的结果。这种情况叫做尾递归，函数式语言通常会对这种情况优化:当调用一个尾递归调用，调用者的栈帧在调用之前弹出，被调用者的栈帧替换调用者的。这很简单：调用者只是返回被调用者的结果。因此，调用 <b>sum2</b> 只需要1个栈帧。
</p>

<p>
使用累加器是把递归函数转换为尾递归函数的常用方法。通常转换一个非尾递归函数到尾递归函数需要满足结合律。
</p>

<p>
如果一个调用在尾部位置，它就是尾递归调用。尾部位置定义如下：
</p>
<ul class="org-ul">
<li>在 <b>fun f(x) = e</b> 中, <b>e</b> 在尾部位置</li>
<li>如果一个表达式不在尾部位置，那么它的子表达式都不在尾部位置</li>
<li>如果 <b>if e1 then e2 else e3</b> 在尾部位置，则 <b>e2</b> 和 <b>e3</b> 在尾部位置( <b>e1</b> 不在),case表达式类似。</li>
<li>如果 <b>let b1 &#x2026; bn in e end</b> 在尾部位置， 则 <b>e</b> 在尾部位置(但绑定中的表达式不在)。</li>
<li>函数调用参数不在尾部位置。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: ntestoc</p>
<p class="date">Created: 2018-12-05 Wed 13:01</p>
<p class="validation"></p>
</div>
</body>
</html>
